#+BEGIN_COMMENT
.. title: Interactive Bokeh Legends
.. slug: interactive-bokeh-legends
.. date: 2019-02-23 19:15:50 UTC-08:00
.. tags: bokeh,legends,interactivity
.. category: Bokeh
.. link: 
.. description: Checking out bokeh interactive legends.
.. type: text

#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 2
** Output The Plot
#+begin_src python :session bokeh :results output raw :exports results
embed = Embed(plot, "interactive_legend")
embed._figure = plot
embed()
#+end_src

#+RESULTS:
#+BEGIN_EXPORT html
<script src="interactive_legend.js" id="11761887-e983-4882-8f9e-2ea31dcf69b0"></script>
#+END_EXPORT
** Output The Plot
#+begin_src python :session bokeh :results output raw :exports results
embed = Embed(fade_plot, "interactive_muted_legend")
embed._figure = fade_plot
embed()
#+end_src

#+RESULTS:
#+BEGIN_EXPORT html
<script src="interactive_muted_legend.js" id="684bd0ee-2d92-45ff-b123-7b90d171bf2c"></script>
#+END_EXPORT
